rails-app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "summary", "body", "active", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save