rails-app/app/controllers/public_controller.rb

SELECT "posts".* FROM "posts"
---
  def homepage
    @posts = Post.all